
* Playground pra trabalhar no EMACS com Org-Mode

#+begin_src python :session :results output
import pyspark
from pyspark.sql import SparkSession
from pyspark.context import SparkContext
#+end_src

#+RESULTS:

#+begin_src python :session :results output
spark = SparkSession.builder.appName("org-mode-meganesa").getOrCreate()
#+end_src

#+RESULTS:
: Using Spark's default log4j profile: org/apache/spark/log4j-defaults.properties
: Setting default log level to "WARN".
: To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
: 22/10/12 23:14:50 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable

#+begin_src python :session :results output
sc = SparkContext.getOrCreate()
#+end_src

#+RESULTS:

#+begin_src python :session :results output
df = spark.read.option("header", True).csv("lotofacil.csv")
#+end_src

#+RESULTS:

#+begin_src python :session :results output
df.show(10)
#+end_src

#+RESULTS:
#+begin_example
+---------+---------+--------+----------+--------------------+--------------------+--------------------+--------------------+--------+---------------------+----------------+------------+-----------+--------+
|  loteria|     nome|concurso|      data|               local|             dezenas|          premiacoes|    estadosPremiados|acumulou|acumuladaProxConcurso|dataProxConcurso|proxConcurso|timeCoracao|mesSorte|
+---------+---------+--------+----------+--------------------+--------------------+--------------------+--------------------+--------+---------------------+----------------+------------+-----------+--------+
|lotofacil|Lotofácil|    2616|17/09/2022|ESPAÇODASORTE em ...|['01', '02', '03'...|[{'acertos': '15 ...|[{'nome': 'Bahia'...|   False|        R$ 1,5 Milhão|      19/09/2022|        2617|       null|    null|
|lotofacil|Lotofácil|    2615|16/09/2022|ESPAÇODASORTE em ...|['02', '03', '05'...|[{'acertos': '15 ...|[{'nome': 'Paraná...|   False|                 null|            null|        2616|       null|    null|
|lotofacil|Lotofácil|    2614|15/09/2022|ESPAÇODASORTE em ...|['01', '02', '03'...|[{'acertos': '15 ...|                  []|    True|                 null|            null|        2615|       null|    null|
|lotofacil|Lotofácil|    2613|14/09/2022|ESPAÇODASORTE em ...|['01', '02', '03'...|[{'acertos': '15 ...|[{'nome': 'Paraíb...|   False|                 null|            null|        2614|       null|    null|
|lotofacil|Lotofácil|    2612|13/09/2022|ESPAÇODASORTE em ...|['01', '03', '06'...|[{'acertos': '15 ...|[{'nome': 'São Pa...|   False|                 null|            null|        2613|       null|    null|
|lotofacil|Lotofácil|    2611|12/09/2022|ESPAÇODASORTE em ...|['02', '03', '04'...|[{'acertos': '15 ...|[{'nome': 'Mato G...|   False|                 null|            null|        2612|       null|    null|
|lotofacil|Lotofácil|    2610|10/09/2022|ESPAÇODASORTE em ...|['01', '03', '05'...|[{'acertos': '15 ...|[{'nome': 'São Pa...|   False|                 null|            null|        2611|       null|    null|
|lotofacil|Lotofácil|    2609|26/08/2022|ESPAÇODASORTE em ...|['03', '05', '06'...|[{'acertos': '15 ...|[{'nome': 'Maranh...|    True|       R$ 180 Milhões|      10/09/2022|        2610|       null|    null|
|lotofacil|Lotofácil|    2608|25/08/2022|ESPAÇODASORTE em ...|['01', '02', '04'...|[{'acertos': '15 ...|                  []|    True|                 null|            null|        2609|       null|    null|
|lotofacil|Lotofácil|    2607|24/08/2022|ESPAÇODASORTE em ...|['01', '03', '05'...|[{'acertos': '15 ...|                  []|    True|                 null|            null|        2608|       null|    null|
+---------+---------+--------+----------+--------------------+--------------------+--------------------+--------------------+--------+---------------------+----------------+------------+-----------+--------+
only showing top 10 rows
#+end_example

#+begin_src python :session :results output
df2 = df.select(
    "dezenas",
    "premiacoes"
)
#+end_src

#+RESULTS:

#+begin_src python :session :results output
df2.show(10, truncate=False)
#+end_src

#+RESULTS:
#+begin_example
+------------------------------------------------------------------------------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
|dezenas                                                                                   |premiacoes                                                                                                                                                                                                                                                                                                                                            |
+------------------------------------------------------------------------------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
|['01', '02', '03', '04', '06', '07', '09', '10', '12', '14', '16', '18', '21', '22', '25']|[{'acertos': '15 Pontos', 'vencedores': 3, 'premio': '527.312,02'}, {'acertos': '14 Pontos', 'vencedores': 237, 'premio': '1.399,56'}, {'acertos': '13 Pontos', 'vencedores': 8935, 'premio': '25,00'}, {'acertos': '12 Pontos', 'vencedores': 111457, 'premio': '10,00'}, {'acertos': '11 Pontos', 'vencedores': 584917, 'premio': '5,00'}]          |
|['02', '03', '05', '06', '08', '09', '10', '14', '15', '17', '19', '20', '21', '22', '25']|[{'acertos': '15 Pontos', 'vencedores': 5, 'premio': '793.883,50'}, {'acertos': '14 Pontos', 'vencedores': 626, 'premio': '1.125,25'}, {'acertos': '13 Pontos', 'vencedores': 18729, 'premio': '25,00'}, {'acertos': '12 Pontos', 'vencedores': 210783, 'premio': '10,00'}, {'acertos': '11 Pontos', 'vencedores': 1081765, 'premio': '5,00'}]        |
|['01', '02', '03', '04', '06', '10', '13', '16', '17', '19', '20', '21', '23', '24', '25']|[{'acertos': '15 Pontos', 'vencedores': 0, 'premio': '-'}, {'acertos': '14 Pontos', 'vencedores': 169, 'premio': '2.007,18'}, {'acertos': '13 Pontos', 'vencedores': 7370, 'premio': '25,00'}, {'acertos': '12 Pontos', 'vencedores': 105757, 'premio': '10,00'}, {'acertos': '11 Pontos', 'vencedores': 567636, 'premio': '5,00'}]                   |
|['01', '02', '03', '05', '06', '08', '11', '14', '15', '16', '18', '19', '20', '21', '25']|[{'acertos': '15 Pontos', 'vencedores': 2, 'premio': '771.473,59'}, {'acertos': '14 Pontos', 'vencedores': 233, 'premio': '1.388,50'}, {'acertos': '13 Pontos', 'vencedores': 9521, 'premio': '25,00'}, {'acertos': '12 Pontos', 'vencedores': 136449, 'premio': '10,00'}, {'acertos': '11 Pontos', 'vencedores': 628634, 'premio': '5,00'}]          |
|['01', '03', '06', '09', '10', '11', '13', '16', '17', '18', '19', '20', '21', '23', '25']|[{'acertos': '15 Pontos', 'vencedores': 1, 'premio': '1.235.457,93'}, {'acertos': '14 Pontos', 'vencedores': 360, 'premio': '1.027,96'}, {'acertos': '13 Pontos', 'vencedores': 14219, 'premio': '25,00'}, {'acertos': '12 Pontos', 'vencedores': 169771, 'premio': '10,00'}, {'acertos': '11 Pontos', 'vencedores': 725249, 'premio': '5,00'}]       |
|['02', '03', '04', '05', '06', '07', '08', '13', '14', '15', '17', '19', '21', '22', '25']|[{'acertos': '15 Pontos', 'vencedores': 4, 'premio': '435.307,17'}, {'acertos': '14 Pontos', 'vencedores': 320, 'premio': '1.629,89'}, {'acertos': '13 Pontos', 'vencedores': 11722, 'premio': '25,00'}, {'acertos': '12 Pontos', 'vencedores': 137987, 'premio': '10,00'}, {'acertos': '11 Pontos', 'vencedores': 753371, 'premio': '5,00'}]         |
|['01', '03', '05', '07', '08', '09', '10', '11', '12', '15', '16', '17', '20', '22', '24']|[{'acertos': '15 Pontos', 'vencedores': 79, 'premio': '2.248.149,10'}, {'acertos': '14 Pontos', 'vencedores': 12202, 'premio': '1.118,16'}, {'acertos': '13 Pontos', 'vencedores': 378406, 'premio': '25,00'}, {'acertos': '12 Pontos', 'vencedores': 4292807, 'premio': '10,00'}, {'acertos': '11 Pontos', 'vencedores': 22099555, 'premio': '5,00'}]|
|['03', '05', '06', '07', '09', '11', '12', '15', '17', '18', '19', '20', '21', '24', '25']|[{'acertos': '15 Pontos', 'vencedores': 3, 'premio': '1.834.872,76'}, {'acertos': '14 Pontos', 'vencedores': 622, 'premio': '1.138,78'}, {'acertos': '13 Pontos', 'vencedores': 22385, 'premio': '25,00'}, {'acertos': '12 Pontos', 'vencedores': 267333, 'premio': '10,00'}, {'acertos': '11 Pontos', 'vencedores': 1350089, 'premio': '5,00'}]      |
|['01', '02', '04', '08', '09', '11', '12', '14', '15', '17', '18', '19', '23', '24', '25']|[{'acertos': '15 Pontos', 'vencedores': 0, 'premio': '-'}, {'acertos': '14 Pontos', 'vencedores': 452, 'premio': '1.203,37'}, {'acertos': '13 Pontos', 'vencedores': 14962, 'premio': '25,00'}, {'acertos': '12 Pontos', 'vencedores': 169249, 'premio': '10,00'}, {'acertos': '11 Pontos', 'vencedores': 871052, 'premio': '5,00'}]                  |
|['01', '03', '05', '07', '08', '09', '10', '14', '16', '17', '18', '22', '23', '24', '25']|[{'acertos': '15 Pontos', 'vencedores': 0, 'premio': '-'}, {'acertos': '14 Pontos', 'vencedores': 218, 'premio': '1.819,26'}, {'acertos': '13 Pontos', 'vencedores': 8847, 'premio': '25,00'}, {'acertos': '12 Pontos', 'vencedores': 114682, 'premio': '10,00'}, {'acertos': '11 Pontos', 'vencedores': 627647, 'premio': '5,00'}]                   |
+------------------------------------------------------------------------------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
only showing top 10 rows
#+end_example

#+begin_src python :session :results output
from pyspark.sql.functions import col, get_json_object, regexp_replace
#+end_src

#+RESULTS:

#+begin_src python :session :results output
df3 = df2.select(
    "dezenas",
,
  
    get_json_object(col("premiacoes"), "$[2].premio")
).toDF("dezenas", "acertos", "vencedores", "premio")
#+end_src

#+RESULTS:

#+begin_src python :session :results output
(
    df2.withColumn("acertos", get_json_object(col("premiacoes"), "$[0].acertos"))
    . withColumn("premiacoes", get_json_object(col("premiacoes"), "$[1].vencedores"),
#+end_src

#+begin_src python :session :results output
df3.select("*").distinct().show(10)
#+end_src

#+RESULTS:
#+begin_example
+--------------------+---------+----------+------+
|             dezenas|  acertos|vencedores|premio|
+--------------------+---------+----------+------+
|['03', '05', '06'...|15 Pontos|       399| 25,00|
|['04', '05', '07'...|15 Pontos|       295| 25,00|
|['01', '02', '04'...|15 Pontos|       336| 25,00|
|['01', '02', '03'...|15 Pontos|       257| 25,00|
|['02', '04', '05'...|15 Pontos|       808| 25,00|
|['02', '04', '06'...|15 Pontos|       281| 25,00|
|['01', '02', '05'...|15 Pontos|       404| 25,00|
|['01', '02', '03'...|15 Pontos|       572| 25,00|
|['01', '02', '03'...|15 Pontos|       404| 20,00|
|['03', '06', '07'...|15 Pontos|       505| 20,00|
+--------------------+---------+----------+------+
only showing top 10 rows
#+end_example
